HalloYang06/PSOC_E84_robot/applications/main.c
    rt_kprintf("[wifi_qa] done init=%ld whd_before=%ld scan_start=%ld scan_result=%ld count=%ld cb=%lu done=%lu timeout=%lu whd_after=%ld\n",
               (long)g_m55_wifi_scan_qa.init_ret,
               (long)g_m55_wifi_scan_qa.whd_diag_ret_before,
               (long)g_m55_wifi_scan_qa.scan_start_ret,
               (long)g_m55_wifi_scan_qa.snapshot.scan_result,
               (long)g_m55_wifi_scan_qa.snapshot.scan_count,
               (unsigned long)g_m55_wifi_scan_qa.snapshot.scan_callback_count,
               (unsigned long)g_m55_wifi_scan_qa.snapshot.scan_done_count,
               (unsigned long)g_m55_wifi_scan_qa.snapshot.scan_timeout_count,
               (long)g_m55_wifi_scan_qa.whd_diag_ret_after);
}

static void m55_console_detach(void)
{
    rt_console_set_device("");
}

static void dump_hex(const char *title, const rt_uint8_t *raw, rt_size_t size)
{
    rt_size_t i;

    rt_kprintf("%s\n", title);
    for (i = 0; i < size; i++)
    {
        rt_kprintf("%02x ", raw[i]);
        if ((i % 16) == 15)
        {
            rt_kprintf("\n");
        }
    }
    if ((size % 16) != 0)
    {
        rt_kprintf("\n");
    }
}

static void whd_dump_head(int argc, char **argv)
{
    const struct fal_partition *part;
    rt_uint8_t raw[32] = {0};

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    part = fal_partition_find("whd_firmware");
    if (!part)
    {
        rt_kprintf("whd_firmware partition not found\n");
        return;
    }

    if (fal_partition_read(part, 0, raw, sizeof(raw)) < 0)
    {
        rt_kprintf("read whd_firmware failed\n");
        return;
    }

    dump_hex("whd_firmware head:", raw, sizeof(raw));
}
MSH_CMD_EXPORT(whd_dump_head, Dump first 32 bytes of whd_firmware partition);

static void whd_dump_block0(int argc, char **argv)
{
    const rt_uint8_t *data = RT_NULL;
    rt_uint8_t copy[32] = {0};
    uint32_t size_out = 0;
    uint32_t result;
    uint32_t fw_size = 0;
    rt_size_t dump_size;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    result = resource_ops.whd_resource_size(RT_NULL, WHD_RESOURCE_WLAN_FIRMWARE, &fw_size);
    rt_kprintf("whd_resource_size result=%u size=%u\n", result, fw_size);
    if (result != 0)
    {
        return;
    }

    result = resource_ops.whd_get_resource_block(RT_NULL, WHD_RESOURCE_WLAN_FIRMWARE, 0, &data, &size_out);
    rt_kprintf("whd_get_resource_block result=%u block0_size=%u data=%p\n", result, size_out, data);
    if (result != 0 || data == RT_NULL)
    {
        return;
    }

    dump_size = size_out < sizeof(copy) ? size_out : sizeof(copy);
    rt_memcpy(copy, data, dump_size);
    dump_hex("whd firmware block0:", copy, dump_size);
}
MSH_CMD_EXPORT(whd_dump_block0, Dump first 32 bytes of WHD firmware block0);

static void openclaw_dump_status(int argc, char **argv)
{
    char json[OPENCLAW_JSON_MEDIUM];

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    openclaw_build_status_json(json, sizeof(json));
    rt_kprintf("%s\n", json);
}
MSH_CMD_EXPORT(openclaw_dump_status, Dump OpenClaw bridge status as JSON);

static void m55_mic_thread_entry(void *parameter)
{
    rt_size_t read_len;
    rt_uint32_t frame_count = 0;
    rt_uint32_t peak = 0;

    RT_UNUSED(parameter);

    while (g_m55_mic.running)
    {
        read_len = rt_device_read(g_m55_mic.dev, 0, g_m55_mic.buffer, sizeof(g_m55_mic.buffer));
        if (read_len > 0)
        {
            rt_size_t i;
            rt_uint32_t local_peak = 0;
            rt_int16_t *samples = (rt_int16_t *)g_m55_mic.buffer;
            rt_size_t sample_count = read_len / sizeof(rt_int16_t);

            for (i = 0; i < sample_count; i++)
            {
                rt_uint32_t mag = (samples[i] < 0) ? (rt_uint32_t)(-samples[i]) : (rt_uint32_t)samples[i];
                if (mag > local_peak)
                {
                    local_peak = mag;
                }
            }

            if (local_peak > peak)
            {
                peak = local_peak;
            }

            frame_count++;
            g_m55_mic.frame_count++;
            g_m55_mic.last_frame_tick = rt_tick_get();
            if ((frame_count % 10U) == 0U)
            {
                rt_kprintf("[m55_mic] read ok len=%u peak=%u frames=%u\n",
                           (unsigned)read_len,
                           (unsigned)peak,
                           (unsigned)frame_count);
                peak = 0;
            }

#ifdef ENABLE_STEREO_INPUT_FEED
            {
                rt_int16_t *mono_samples = (rt_int16_t *)g_m55_mic.mono_buffer;
                rt_size_t mono_count = sample_count / 2U;

                for (i = 0; i < mono_count; i++)
                {
                    rt_int32_t left = samples[i * 2U];
                    rt_int32_t right = samples[(i * 2U) + 1U];

                    mono_samples[i] = (rt_int16_t)((left + right) / 2);
                }
                (void)voice_service_submit_local_pcm(g_m55_mic.mono_buffer,
                                                     (rt_uint32_t)(mono_count * sizeof(rt_int16_t)));
            }
#else
            (void)voice_service_submit_local_pcm(g_m55_mic.buffer, (rt_uint32_t)read_len);
#endif
        }
        else
        {
            rt_thread_mdelay(10);
        }
    }
}

static rt_err_t m55_mic_start_internal(void)
{
    struct rt_audio_caps caps;

    if (g_m55_mic.running)
    {
        rt_tick_t last_frame_tick = g_m55_mic.last_frame_tick;
        rt_tick_t stale_ticks = rt_tick_from_millisecond(2000);

        if ((last_frame_tick == 0U) ||
            ((rt_int32_t)(rt_tick_get() - last_frame_tick) <= (rt_int32_t)stale_ticks))
        {
            return -RT_EBUSY;
        }

        rt_kprintf("[m55_mic] stale running state, restart frames=%lu age_ticks=%lu\n",
                   (unsigned long)g_m55_mic.frame_count,
                   (unsigned long)(rt_tick_get() - last_frame_tick));
        g_m55_mic.running = RT_FALSE;
        rt_thread_mdelay(80);
        g_m55_mic.thread = RT_NULL;
    }

    if (g_m55_mic.dev == RT_NULL)
    {
        g_m55_mic.dev = rt_device_find("mic0");
        if (g_m55_mic.dev == RT_NULL)
        {
            rt_kprintf("[m55_mic] mic0 not found\n");
            return -RT_ERROR;
        }

        if (rt_device_open(g_m55_mic.dev, RT_DEVICE_OFLAG_RDONLY) != RT_EOK)
        {
            rt_kprintf("[m55_mic] open mic0 failed\n");
            g_m55_mic.dev = RT_NULL;
            return -RT_ERROR;
        }

        rt_memset(&caps, 0, sizeof(caps));
        caps.main_type = AUDIO_TYPE_INPUT;
        caps.sub_type = AUDIO_DSP_PARAM;
        caps.udata.config.samplerate = M55_AUDIO_SAMPLE_RATE;
        caps.udata.config.channels = M55_AUDIO_CHANNELS;
        caps.udata.config.samplebits = M55_AUDIO_BITS_PER_SAMPLE;
        if (rt_device_control(g_m55_mic.dev, AUDIO_CTL_CONFIGURE, &caps) == RT_EOK)
        {
            cy_rslt_t gain_ret = set_pdm_pcm_gain((rt_int16_t)M55_XIAOZHI_PDM_GAIN);

