HalloYang06/PSOC_E84_robot/applications/main.c
            rt_kprintf("[m55_mic] configured mic0 sr=%d ch=%d bits=%d\n",
                       M55_AUDIO_SAMPLE_RATE,
                       M55_AUDIO_CHANNELS,
                       M55_AUDIO_BITS_PER_SAMPLE);
            rt_kprintf("[m55_mic] pdm_gain=%d ret=%ld\n",
                       M55_XIAOZHI_PDM_GAIN,
                       (long)gain_ret);
        }
        else
        {
            rt_kprintf("[m55_mic] configure mic0 failed\n");
        }
    }

    g_m55_mic.running = RT_TRUE;
    g_m55_mic.last_frame_tick = 0U;
    g_m55_mic.thread = rt_thread_create("m55_mic",
                                        m55_mic_thread_entry,
                                        RT_NULL,
                                        M55_MIC_THREAD_STACK,
                                        18,
                                        10);
    if (g_m55_mic.thread == RT_NULL)
    {
        g_m55_mic.running = RT_FALSE;
        rt_kprintf("[m55_mic] create thread failed\n");
        return -RT_ERROR;
    }

    rt_thread_startup(g_m55_mic.thread);
    rt_kprintf("[m55_mic] started\n");
    (void)voice_service_publish_status_now();
    return RT_EOK;
}

static rt_err_t m55_mic_stop_internal(void)
{
    if (!g_m55_mic.running)
    {
        return RT_EOK;
    }

    g_m55_mic.running = RT_FALSE;
    rt_thread_mdelay(50);
    g_m55_mic.thread = RT_NULL;
    rt_kprintf("[m55_mic] stopped\n");
    (void)voice_service_publish_status_now();
    return RT_EOK;
}

static void m55_mic_test(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = m55_mic_start_internal();
    rt_kprintf("m55_mic_test ret=%d\n", ret);
}
MSH_CMD_EXPORT(m55_mic_test, Start local CM55 mic0 capture test);

static void m55_mic_stop(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = m55_mic_stop_internal();
    rt_kprintf("m55_mic_stop ret=%d\n", ret);
}
MSH_CMD_EXPORT(m55_mic_stop, Stop local CM55 mic0 capture test);

rt_err_t m55_speaker_tone_internal(rt_uint32_t duration_ms)
{
    rt_device_t speaker;
    struct rt_audio_caps caps;
    rt_int16_t frame[160];
    rt_uint32_t frame_count;
    rt_uint32_t frame_index;
    rt_uint32_t i;
    rt_err_t ret;
    rt_size_t written_total = 0U;

    speaker = rt_device_find("sound0");
    if (speaker == RT_NULL)
    {
        rt_kprintf("[m55qa] sound0 not found\n");
        return -101;
    }
    rt_kprintf("[m55qa] sound0 dev=%p flag=0x%lx open=0x%lx ref=%u\n",
               speaker,
               (unsigned long)speaker->flag,
               (unsigned long)speaker->open_flag,
               (unsigned)speaker->ref_count);

    rt_memset(&caps, 0, sizeof(caps));
    caps.main_type = AUDIO_TYPE_OUTPUT;
    caps.sub_type = AUDIO_DSP_PARAM;
    caps.udata.config.samplerate = M55_AUDIO_SAMPLE_RATE;
    caps.udata.config.channels = 1;
    caps.udata.config.samplebits = M55_AUDIO_BITS_PER_SAMPLE;
    ret = rt_device_control(speaker, AUDIO_CTL_CONFIGURE, &caps);
    rt_kprintf("[m55qa] speaker tone configure ret=%d ms=%lu\n",
               ret,
               (unsigned long)duration_ms);
    if ((ret != RT_EOK) && (ret != -RT_ENOSYS))
    {
        return ret;
    }

    ret = rt_device_open(speaker, RT_DEVICE_OFLAG_WRONLY);
    rt_kprintf("[m55qa] open sound0 ret=%d flag=0x%lx open=0x%lx ref=%u\n",
               ret,
               (unsigned long)speaker->flag,
               (unsigned long)speaker->open_flag,
               (unsigned)speaker->ref_count);
    if ((ret != RT_EOK) && (ret != -RT_EBUSY))
    {
        rt_kprintf("[m55qa] open sound0 failed ret=%d\n", ret);
        return ret;
    }

    frame_count = duration_ms / 10U;
    if (frame_count == 0U)
    {
        frame_count = 1U;
    }

    for (frame_index = 0; frame_index < frame_count; frame_index++)
    {
        for (i = 0; i < (sizeof(frame) / sizeof(frame[0])); i++)
        {
            rt_uint32_t phase = ((frame_index * (sizeof(frame) / sizeof(frame[0]))) + i) % 32U;
            frame[i] = (phase < 16U) ? 6000 : -6000;
        }
        written_total += rt_device_write(speaker, 0, frame, sizeof(frame));
        rt_thread_mdelay(10);
    }

    rt_kprintf("[m55qa] speaker tone done written=%lu\n", (unsigned long)written_total);
    return (written_total > 0U) ? RT_EOK : -102;
}

static void m55qa_speaker_tone(int argc, char **argv)
{
    rt_uint32_t duration_ms = 1000U;
    rt_err_t ret;

    if (argc >= 2)
    {
        duration_ms = (rt_uint32_t)atoi(argv[1]);
        if (duration_ms == 0U)
        {
            duration_ms = 1000U;
        }
    }

    ret = m55_speaker_tone_internal(duration_ms);
    rt_kprintf("[m55qa] speaker_tone ret=%d\n", ret);
}
MSH_CMD_EXPORT(m55qa_speaker_tone, Play a local CM55 sound0 QA tone; arg ms);

static void voice_test(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = m55_xiaozhi_talk_start_from_ui();
    rt_kprintf("voice_test ret=%d\n", ret);
}
MSH_CMD_EXPORT(voice_test, Start Xiaozhi listening from CM55 mic0);

static void voice_stop(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = m55_xiaozhi_talk_stop_from_ui();
    rt_kprintf("voice_stop ret=%d\n", ret);
}
MSH_CMD_EXPORT(voice_stop, Stop Xiaozhi listening from CM55 mic0);

static void wake_on(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = m55_wake_listen_start_for_xiaozhi();
    rt_kprintf("wake_on ret=%d\n", ret);
}
MSH_CMD_EXPORT(wake_on, Start wake listening from CM55 mic0);

static void wake_off(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = m55_wake_listen_stop_for_xiaozhi();
    rt_kprintf("wake_off ret=%d\n", ret);
}
MSH_CMD_EXPORT(wake_off, Stop wake listening from CM55 mic0);

static void wake_dump_pcm(int argc, char **argv)
{
    const char *path = "/latest_wake.pcm";
    rt_err_t ret;

    if ((argc >= 2) && (argv[1] != RT_NULL) && (argv[1][0] != '\0'))
    {
        path = argv[1];
    }

    ret = voice_service_dump_latest_pcm(path);
    rt_kprintf("wake_dump_pcm ret=%d path=%s\n", ret, path);
}
MSH_CMD_EXPORT(wake_dump_pcm, Save latest CM55 wake PCM to a raw pcm file);

static void xz_url(int argc, char **argv)
{
    rt_err_t ret;

    if (argc < 2)
    {
        rt_kprintf("xz_url current=%s\n", xiaozhi_voice_relay_get_url());
        return;
    }

    ret = xiaozhi_voice_relay_set_url(argv[1]);
    rt_kprintf("xz_url ret=%d url=%s\n", ret, xiaozhi_voice_relay_get_url());
}
MSH_CMD_EXPORT(xz_url, Get or set Xiaozhi websocket URL);

static void xz_token(int argc, char **argv)
{
    rt_err_t ret;

    if (argc < 2)
    {
        rt_kprintf("xz_token configured=%d\n", xiaozhi_voice_relay_has_token() ? 1 : 0);
        return;
    }

    ret = xiaozhi_voice_relay_set_token(argv[1]);
    rt_kprintf("xz_token ret=%d configured=%d\n", ret, xiaozhi_voice_relay_has_token() ? 1 : 0);
}
MSH_CMD_EXPORT(xz_token, Set Xiaozhi platform relay token);

