HalloYang06/PSOC_E84_robot/applications/main.c
static void xz_token_begin(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = xiaozhi_voice_relay_token_update_begin();
    rt_kprintf("xz_token_begin ret=%d\n", ret);
}
MSH_CMD_EXPORT(xz_token_begin, Begin chunked Xiaozhi platform token update);

static void xz_token_part(int argc, char **argv)
{
    rt_err_t ret;

    if (argc < 2)
    {
        rt_kprintf("usage: xz_token_part <token_chunk_48_to_60_chars>\n");
        return;
    }

    ret = xiaozhi_voice_relay_token_update_part(argv[1]);
    rt_kprintf("xz_token_part ret=%d len=%lu\n",
               ret,
               (unsigned long)rt_strlen(argv[1]));
}
MSH_CMD_EXPORT(xz_token_part, Append one chunk to Xiaozhi platform token);

static void xz_token_commit(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = xiaozhi_voice_relay_token_update_commit();
    rt_kprintf("xz_token_commit ret=%d configured=%d\n",
               ret,
               xiaozhi_voice_relay_has_token() ? 1 : 0);
}
MSH_CMD_EXPORT(xz_token_commit, Commit chunked Xiaozhi platform token);

static void xz_token_clear(int argc, char **argv)
{
    RT_UNUSED(argc);
    RT_UNUSED(argv);

    xiaozhi_voice_relay_token_update_clear();
    rt_kprintf("xz_token_clear configured=%d\n", xiaozhi_voice_relay_has_token() ? 1 : 0);
}
MSH_CMD_EXPORT(xz_token_clear, Clear Xiaozhi platform token);

static void xz_reconnect(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = voice_service_reconnect_xiaozhi();
    rt_kprintf("xz_reconnect ret=%d\n", ret);
}
MSH_CMD_EXPORT(xz_reconnect, Reconnect Xiaozhi websocket after URL or token change);

static void xz_status(int argc, char **argv)
{
    RT_UNUSED(argc);
    RT_UNUSED(argv);

    rt_kprintf("xz_status url=%s\n", xiaozhi_voice_relay_get_url());
    rt_kprintf("xz_status token=%d connected=%d ws_stage=%d ws_errno=%d\n",
               xiaozhi_voice_relay_has_token() ? 1 : 0,
               websocket_client_is_connected() ? 1 : 0,
               websocket_client_last_stage(),
               websocket_client_last_errno());
}
MSH_CMD_EXPORT(xz_status, Show Xiaozhi websocket status without printing token);

static void xz_tcp_probe(int argc, char **argv)
{
    const char *ip = M55_XIAOZHI_CLOUD_IP;
    int port = M55_XIAOZHI_CLOUD_PORT;
    int fd;
    int ret;
    int native_errno;
    struct sockaddr_in cloud_addr;

    if (argc >= 2)
    {
        ip = argv[1];
    }
    if (argc >= 3)
    {
        port = atoi(argv[2]);
    }

    rt_memset(&cloud_addr, 0, sizeof(cloud_addr));
    cloud_addr.sin_family = AF_INET;
    cloud_addr.sin_port = htons((uint16_t)port);
    cloud_addr.sin_addr.s_addr = inet_addr(ip);

    errno = 0;
    fd = lwip_socket(AF_INET, SOCK_STREAM, 0);
    native_errno = errno;
    if (fd < 0)
    {
        rt_kprintf("xz_tcp_probe socket fd=%d errno=%d\n", fd, native_errno);
        return;
    }

    errno = 0;
    ret = lwip_connect(fd, (struct sockaddr *)&cloud_addr, sizeof(cloud_addr));
    native_errno = errno;
    lwip_close(fd);
    rt_kprintf("xz_tcp_probe ip=%s port=%d ret=%d errno=%d\n", ip, port, ret, native_errno);
}
MSH_CMD_EXPORT(xz_tcp_probe, Probe Xiaozhi cloud TCP port);

static rt_err_t m55_voice_start_for_xiaozhi(void)
{
    rt_err_t ret;

    ret = voice_service_init("YOUR_BAIDU_API_KEY", "YOUR_BAIDU_SECRET_KEY");
    if ((ret != RT_EOK) && (ret != -RT_EBUSY))
    {
        rt_kprintf("[m55] voice init ret=%d\n", ret);
        return ret;
    }

    ret = voice_service_start();
    if ((ret != RT_EOK) && (ret != -RT_EBUSY))
    {
        rt_kprintf("[m55] voice start ret=%d\n", ret);
        return ret;
    }

    return RT_EOK;
}

static rt_err_t m55_wake_listen_start_for_xiaozhi(void)
{
    rt_err_t ret;

    ret = m55_voice_start_for_xiaozhi();
    if (ret != RT_EOK)
    {
        return ret;
    }

    ret = voice_service_set_wake_listening_direct(RT_TRUE);
    if (ret != RT_EOK)
    {
        return ret;
    }

    ret = m55_mic_start_internal();
    if ((ret == RT_EOK) || (ret == -RT_EBUSY))
    {
        return RT_EOK;
    }

    (void)voice_service_set_wake_listening_direct(RT_FALSE);
    return ret;
}

static rt_err_t m55_wake_listen_stop_for_xiaozhi(void)
{
    rt_err_t ret;

    ret = voice_service_set_wake_listening_direct(RT_FALSE);
    (void)m55_mic_stop_internal();
    return ret;
}

rt_err_t m55_xiaozhi_talk_start_from_ui(void)
{
    rt_err_t ret;

    ret = m55_voice_start_for_xiaozhi();
    if ((ret == RT_EOK) || (ret == -RT_EBUSY))
    {
        ret = voice_service_start_xiaozhi_talk();
    }
    if ((ret == RT_EOK) || (ret == -RT_EBUSY))
    {
        ret = m55_mic_start_internal();
    }

    rt_kprintf("[m55] ui xiaozhi talk start ret=%d token=%d connected=%d ws_stage=%d ws_errno=%d\n",
               ret,
               xiaozhi_voice_relay_has_token() ? 1 : 0,
               websocket_client_is_connected() ? 1 : 0,
               websocket_client_last_stage(),
               websocket_client_last_errno());
    (void)voice_service_publish_status_now();
    return ret;
}

rt_err_t m55_xiaozhi_talk_stop_from_ui(void)
{
    rt_err_t ret;

    ret = voice_service_stop_xiaozhi_talk();
    (void)voice_service_set_wake_listening_direct(RT_TRUE);
    (void)m55_mic_start_internal();
    rt_kprintf("[m55] ui xiaozhi talk stop ret=%d connected=%d ws_stage=%d ws_errno=%d\n",
               ret,
               websocket_client_is_connected() ? 1 : 0,
               websocket_client_last_stage(),
               websocket_client_last_errno());
    (void)voice_service_publish_status_now();
    return ret;
}

static void xiaozhi_auto_connect_thread_entry(void *parameter)
{
    rt_err_t ret;
    rt_bool_t voice_ready = RT_FALSE;
    rt_uint32_t wifi_ready_streak = 0U;
    rt_uint32_t retry_delay = 0U;

    RT_UNUSED(parameter);

    (void)xiaozhi_voice_relay_init();
    rt_kprintf("[m55_xz_auto] token=%d len=%lu url=%s\n",
               xiaozhi_voice_relay_has_token() ? 1 : 0,
               (unsigned long)xiaozhi_voice_relay_token_len(),
               xiaozhi_voice_relay_get_url());

    for (rt_uint32_t i = 0; i < 300U; i++)
    {
        wifi_config_snapshot_t snapshot;

        rt_thread_mdelay(2000);

        if (!xiaozhi_voice_relay_has_token())
        {
            continue;
        }

        (void)wifi_config_diag();
        wifi_config_get_snapshot(&snapshot);
        if ((snapshot.wlan_ready == 0U) || (snapshot.netdev_ip == 0U))
        {
            wifi_ready_streak = 0U;
            continue;
        }
        if (++wifi_ready_streak < 3U)
        {
            continue;
        }
        if (retry_delay > 0U)
        {
            retry_delay--;
            continue;
        }

        if (!voice_ready)
        {
            ret = m55_voice_start_for_xiaozhi();
            if ((ret == RT_EOK) || (ret == -RT_EBUSY))
            {
                voice_ready = RT_TRUE;
                rt_kprintf("[m55_xz_auto] voice service started after wifi ready\n");
            }
            else
            {
                rt_kprintf("[m55_xz_auto] voice service deferred ret=%d\n", ret);
                retry_delay = 5U;
                xiaozhi_bridge_publish_status();
                continue;
            }
        }

        rt_kprintf("[m55_xz_auto] wifi ready ip=0x%08lx, reconnect Xiaozhi\n",
                   (unsigned long)snapshot.netdev_ip);
        ret = voice_service_reconnect_xiaozhi();
        rt_kprintf("[m55_xz_auto] reconnect ret=%d connected=%d stage=%d errno=%d\n",
                   ret,
                   websocket_client_is_connected() ? 1 : 0,
                   websocket_client_last_stage(),
                   websocket_client_last_errno());
        xiaozhi_bridge_publish_status();
        if (ret == RT_EOK)
        {
            ret = m55_wake_listen_start_for_xiaozhi();
            if (ret == RT_EOK)
            {
                g_xiaozhi_voice_started = RT_TRUE;
                rt_kprintf("[m55_xz_auto] wake listening armed after Xiaozhi connected\n");
            }
            else
            {
                rt_kprintf("[m55_xz_auto] wake listen deferred after connect ret=%d\n", ret);
            }
            break;
        }
        retry_delay = 5U;
    }

    g_xiaozhi_auto_thread = RT_NULL;
}

