HalloYang06/PSOC_E84_robot/applications/main.c
static void xz_talk_on(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = m55_voice_start_for_xiaozhi();
    if ((ret == RT_EOK) || (ret == -RT_EBUSY))
    {
        ret = voice_service_start_xiaozhi_talk();
    }
    if ((ret == RT_EOK) || (ret == -RT_EBUSY))
    {
        ret = m55_mic_start_internal();
    }

    rt_kprintf("xz_talk_on ret=%d token=%d connected=%d ws_stage=%d ws_errno=%d\n",
               ret,
               xiaozhi_voice_relay_has_token() ? 1 : 0,
               websocket_client_is_connected() ? 1 : 0,
               websocket_client_last_stage(),
               websocket_client_last_errno());
}
MSH_CMD_EXPORT(xz_talk_on, Start manual Xiaozhi cloud listening from CM55 mic);

static void xz_talk_off(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = voice_service_stop_xiaozhi_talk();
    (void)voice_service_set_wake_listening_direct(RT_TRUE);
    (void)m55_mic_start_internal();
    rt_kprintf("xz_talk_off ret=%d connected=%d ws_stage=%d ws_errno=%d\n",
               ret,
               websocket_client_is_connected() ? 1 : 0,
               websocket_client_last_stage(),
               websocket_client_last_errno());
}
MSH_CMD_EXPORT(xz_talk_off, Stop manual Xiaozhi cloud listening);

static void xz_qa_text(int argc, char **argv)
{
    const char *text = (argc >= 2) ? argv[1] : RT_NULL;
    rt_err_t ret = voice_service_qa_xiaozhi_text_turn(text);

    rt_kprintf("xz_qa_text ret=%d connected=%d ws_stage=%d ws_errno=%d\n",
               ret,
               websocket_client_is_connected() ? 1 : 0,
               websocket_client_last_stage(),
               websocket_client_last_errno());
}
MSH_CMD_EXPORT(xz_qa_text, Send a XiaoZhi QA text turn through platform TTS);

static void xiaozhi_bridge_publish_ack(rt_uint32_t cmd, rt_err_t ret)
{
    m33_m55_message_t ack;

    rt_memset(&ack, 0, sizeof(ack));
    ack.type = MSG_TYPE_VOICE_CONTROL_ACK;
    ack.payload.voice_control.cmd = cmd;
    ack.payload.voice_control.arg0 = (rt_uint32_t)ret;
    ack.payload.voice_control.arg1 = (rt_uint32_t)rt_tick_get();
    (void)m33_m55_comm_publish(&ack);
}

static void xiaozhi_capture_start_worker_entry(void *parameter)
{
    rt_err_t ret;

    RT_UNUSED(parameter);

    ret = voice_service_start_xiaozhi_talk();
    rt_kprintf("[m55_xz_bridge] async start_capture talk_start ret=%d connected=%d stage=%d errno=%d\n",
               ret,
               websocket_client_is_connected() ? 1 : 0,
               websocket_client_last_stage(),
               websocket_client_last_errno());
    if ((ret != RT_EOK) && (ret != -RT_EBUSY))
    {
        voice_service_note_error(-41002);
        g_xiaozhi_capture_start_pending = RT_FALSE;
        (void)voice_service_publish_status_now();
        return;
    }

    ret = m55_mic_start_internal();
    rt_kprintf("[m55_xz_bridge] async start_capture mic_start ret=%d\n", ret);
    if (ret == -RT_EBUSY)
    {
        ret = RT_EOK;
    }
    if (ret != RT_EOK)
    {
        voice_service_note_error(-41003);
    }

    g_xiaozhi_capture_start_pending = RT_FALSE;
    (void)voice_service_publish_status_now();
}

static rt_err_t xiaozhi_bridge_start_capture_async(void)
{
    rt_thread_t thread;

    if (g_xiaozhi_capture_start_pending)
    {
        return -RT_EBUSY;
    }

    g_xiaozhi_capture_start_pending = RT_TRUE;
    thread = rt_thread_create("xz_cap_on",
                              xiaozhi_capture_start_worker_entry,
                              RT_NULL,
                              4096,
                              22,
                              10);
    if (thread == RT_NULL)
    {
        g_xiaozhi_capture_start_pending = RT_FALSE;
        return -RT_ENOMEM;
    }

    rt_thread_startup(thread);
    return RT_EOK;
}

static rt_err_t m55_bridge_run_tcp_probe(void)
{
    int fd;
    int ret;
    int opt_error = 0;
    socklen_t opt_len = sizeof(opt_error);
    fd_set writefds;
    struct timeval timeout;
    struct sockaddr_in addr;

    g_tcp_probe_stage = 0;
    g_tcp_probe_errno = 0;
    g_tcp_probe_result = -RT_ERROR;
    g_tcp_probe_so_error = 0;
    g_tcp_probe_select_ret = 0;
    g_tcp_probe_fcntl_ret = 0;
    xiaozhi_bridge_publish_status();

    rt_memset(&addr, 0, sizeof(addr));
    addr.sin_family = AF_INET;
    addr.sin_port = htons(M55_XIAOZHI_CLOUD_PORT);
    addr.sin_addr.s_addr = inet_addr(M55_XIAOZHI_CLOUD_IP);

    errno = 0;
    g_tcp_probe_stage = 10;
    xiaozhi_bridge_publish_status();
    fd = socket(AF_INET, SOCK_STREAM, 0);
    if (fd < 0)
    {
        g_tcp_probe_errno = errno;
        g_tcp_probe_result = -RT_ERROR;
        rt_kprintf("[m55_tcp_probe] socket failed fd=%d errno=%d\n", fd, errno);
        xiaozhi_bridge_publish_status();
        return -RT_ERROR;
    }

    errno = 0;
    g_tcp_probe_stage = 20;
    xiaozhi_bridge_publish_status();
    ret = fcntl(fd, F_SETFL, O_NONBLOCK);
    g_tcp_probe_fcntl_ret = ret;
    if (ret < 0)
    {
        g_tcp_probe_errno = errno;
        g_tcp_probe_result = -RT_ERROR;
        rt_kprintf("[m55_tcp_probe] fcntl nonblock failed fd=%d ret=%d errno=%d\n", fd, ret, errno);
        closesocket(fd);
        xiaozhi_bridge_publish_status();
        return -RT_ERROR;
    }

    errno = 0;
    g_tcp_probe_stage = 30;
    xiaozhi_bridge_publish_status();
    ret = connect(fd, (struct sockaddr *)&addr, sizeof(addr));
    g_tcp_probe_result = ret;
    g_tcp_probe_errno = errno;
    if (ret == 0)
    {
        g_tcp_probe_stage = 60;
        g_tcp_probe_so_error = 0;
        rt_kprintf("[m55_tcp_probe] connect immediate ok %s:%d fd=%d\n",
                   M55_XIAOZHI_CLOUD_IP,
                   M55_XIAOZHI_CLOUD_PORT,
                   fd);
        closesocket(fd);
        xiaozhi_bridge_publish_status();
        return RT_EOK;
    }

    if ((errno != EINPROGRESS) && (errno != EWOULDBLOCK) && (errno != EALREADY))
    {
        rt_kprintf("[m55_tcp_probe] connect immediate failed ret=%d errno=%d\n", ret, errno);
        closesocket(fd);
        xiaozhi_bridge_publish_status();
        return -RT_ERROR;
    }

