HalloYang06/PSOC_E84_robot/applications/main.c
    FD_ZERO(&writefds);
    FD_SET(fd, &writefds);
    timeout.tv_sec = 5;
    timeout.tv_usec = 0;

    errno = 0;
    g_tcp_probe_stage = 40;
    xiaozhi_bridge_publish_status();
    ret = select(fd + 1, RT_NULL, &writefds, RT_NULL, &timeout);
    g_tcp_probe_select_ret = ret;
    g_tcp_probe_errno = errno;
    if (ret <= 0)
    {
        g_tcp_probe_result = (ret == 0) ? -RT_ETIMEOUT : -RT_ERROR;
        rt_kprintf("[m55_tcp_probe] select failed ret=%d errno=%d\n", ret, errno);
        closesocket(fd);
        xiaozhi_bridge_publish_status();
        return (ret == 0) ? -RT_ETIMEOUT : -RT_ERROR;
    }

    errno = 0;
    g_tcp_probe_stage = 50;
    xiaozhi_bridge_publish_status();
    ret = getsockopt(fd, SOL_SOCKET, SO_ERROR, &opt_error, &opt_len);
    g_tcp_probe_errno = errno;
    g_tcp_probe_so_error = opt_error;
    if ((ret < 0) || (opt_error != 0))
    {
        g_tcp_probe_result = (ret < 0) ? -RT_ERROR : -opt_error;
        rt_kprintf("[m55_tcp_probe] so_error ret=%d errno=%d so_error=%d\n", ret, errno, opt_error);
        closesocket(fd);
        xiaozhi_bridge_publish_status();
        return -RT_ERROR;
    }

    g_tcp_probe_stage = 60;
    g_tcp_probe_result = 0;
    g_tcp_probe_errno = 0;
    rt_kprintf("[m55_tcp_probe] connect ok %s:%d fd=%d select=%d\n",
               M55_XIAOZHI_CLOUD_IP,
               M55_XIAOZHI_CLOUD_PORT,
               fd,
               g_tcp_probe_select_ret);
    closesocket(fd);
    xiaozhi_bridge_publish_status();
    return RT_EOK;
}

static void xiaozhi_bridge_publish_status(void)
{
    m33_m55_message_t status;

    if (voice_service_publish_status_now() == RT_EOK)
    {
        return;
    }

    rt_memset(&status, 0, sizeof(status));
    status.type = MSG_TYPE_VOICE_STATUS;
    status.payload.voice_status.flags =
        (xiaozhi_voice_relay_has_token() ? VOICE_STATUS_FLAG_XIAOZHI_HAS_TOKEN : 0U) |
        (websocket_client_is_connected() ? VOICE_STATUS_FLAG_XIAOZHI_CONNECTED : 0U);
    wifi_config_fill_voice_status(&status.payload.voice_status);
    if (xiaozhi_voice_relay_has_token())
    {
        status.payload.voice_status.flags |= VOICE_STATUS_FLAG_XIAOZHI_HAS_TOKEN;
    }
    if (websocket_client_is_connected())
    {
        status.payload.voice_status.flags |= VOICE_STATUS_FLAG_XIAOZHI_CONNECTED;
    }
    status.payload.voice_status.xiaozhi_ws_stage = websocket_client_last_stage();
    status.payload.voice_status.xiaozhi_ws_errno = websocket_client_last_errno();
    status.payload.voice_status.xiaozhi_token_len = (rt_uint32_t)xiaozhi_voice_relay_token_len();
    status.payload.voice_status.xiaozhi_token_staging_len = (rt_uint32_t)xiaozhi_voice_relay_token_staging_len();
    status.payload.voice_status.net_probe_posix_tcp = (rt_int32_t)g_xz_bridge_loops;
    status.payload.voice_status.net_probe_posix_errno = (rt_int32_t)g_xz_bridge_consumed;
    status.payload.voice_status.net_probe_sal_tcp = g_xz_bridge_last_consume_ret;
    status.payload.voice_status.net_probe_sal_errno = (rt_int32_t)g_xz_bridge_last_msg_type;
    status.payload.voice_status.net_probe_lwip_tcp = (rt_int32_t)g_xz_reconnect_step;
    status.payload.voice_status.net_probe_lwip_errno = g_xz_reconnect_result;
    status.payload.voice_status.cloud_tcp_result = g_tcp_probe_select_ret;
    status.payload.voice_status.cloud_tcp_errno = g_tcp_probe_fcntl_ret;
    (void)m33_m55_comm_publish(&status);
}

rt_uint32_t voice_service_bridge_diag_loops(void)
{
    return g_xz_bridge_loops;
}

rt_uint32_t voice_service_bridge_diag_consumed(void)
{
    return g_xz_bridge_consumed;
}

rt_int32_t voice_service_bridge_diag_last_ret(void)
{
    return g_xz_bridge_last_consume_ret;
}

rt_int32_t voice_service_bridge_diag_phase(void)
{
    return g_xz_bridge_phase;
}

static void xiaozhi_reconnect_thread_entry(void *parameter)
{
    rt_err_t ret;
    rt_bool_t service_ready;

    RT_UNUSED(parameter);

    g_xz_reconnect_step = 10U;
    g_xz_reconnect_result = 0;

    ret = voice_service_init("YOUR_BAIDU_API_KEY", "YOUR_BAIDU_SECRET_KEY");
    g_xz_reconnect_result = ret;
    g_xz_reconnect_step = 11U;
    service_ready = ((ret == RT_EOK) || (ret == -RT_EBUSY)) ? RT_TRUE : RT_FALSE;
    if (service_ready)
    {
        g_xiaozhi_voice_started = RT_TRUE;
        g_xz_reconnect_step = 20U;
        g_xz_reconnect_result = RT_EOK;
        if (!websocket_client_is_connected())
        {
            g_xz_reconnect_step = 30U;
            ret = websocket_client_connect();
            g_xz_reconnect_result = ret;
            g_xz_reconnect_step = 31U;
        }
        else
        {
            ret = RT_EOK;
        }
        if (ret == RT_EOK)
        {
            char hello[768];

            g_xz_reconnect_step = 40U;
            ret = xiaozhi_voice_relay_build_hello(hello, sizeof(hello));
            if (ret == RT_EOK)
            {
                ret = websocket_client_send_text(hello);
            }
            g_xz_reconnect_result = ret;
            g_xz_reconnect_step = 41U;
        }
    }

    g_xz_reconnect_thread = RT_NULL;
}

static rt_err_t xiaozhi_bridge_start_reconnect_async(void)
{
    if (g_xz_reconnect_thread != RT_NULL)
    {
        return -RT_EBUSY;
    }

    wifi_status_publish_kick();
    g_xz_reconnect_thread = rt_thread_create("xz_reconn",
                                             xiaozhi_reconnect_thread_entry,
                                             RT_NULL,
                                             12288,
                                             17,
                                             10);
    if (g_xz_reconnect_thread == RT_NULL)
    {
        return -RT_ENOMEM;
    }

    rt_thread_startup(g_xz_reconnect_thread);
    return RT_EOK;
}

static void wifi_status_publish_thread_entry(void *parameter)
{
    RT_UNUSED(parameter);

    for (rt_uint32_t i = 0; i < 45U; i++)
    {
        (void)wifi_config_diag();
        (void)wifi_config_whd_diag();
        xiaozhi_bridge_publish_status();
        rt_thread_mdelay(1000);
    }

    g_wifi_status_thread = RT_NULL;
}

static void wifi_status_publish_kick(void)
{
    if (g_wifi_status_thread != RT_NULL)
    {
        return;
    }

